In [36]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

In [3]:
car_df = pd.read_csv("cars_data/car.data")
print('Dataset Loaded...')
car_df.head()

#creating the feature set

Dataset Loaded...

  buying  maint doors persons lug_boot safety  class
0  vhigh  vhigh     2       2    small    low  unacc
1  vhigh  vhigh     2       2    small    med  unacc
2  vhigh  vhigh     2       2    small   high  unacc
3  vhigh  vhigh     2       2      med    low  unacc
4  vhigh  vhigh     2       2      med    med  unacc

In [17]:
numerical = car_df.drop(columns=['class', 'buying', 'maint', 'lug_boot', 'safety'], axis=1)
numerical

      doors persons
0         2       2
1         2       2
2         2       2
3         2       2
4         2       2
...     ...     ...
1723  5more    more
1724  5more    more
1725  5more    more
1726  5more    more
1727  5more    more

[1728 rows x 2 columns]

In [20]:
myMapNum = {'5more': 5, 'more': 5}
newNum = numerical.replace(myMapNum)
newNum

     doors persons
0        2       2
1        2       2
2        2       2
3        2       2
4        2       2
...    ...     ...
1723     5       5
1724     5       5
1725     5       5
1726     5       5
1727     5       5

[1728 rows x 2 columns]

In [ ]:
# buying:   vhigh, high, med, low.
# maint:    vhigh, high, med, low.
# doors:    2, 3, 4, 5more.
# persons:  2, 4, more.
# lug_boot: small, med, big.
# safety:   low, med, high.
# class: unacc, acc, good, vgood

In [21]:
categorical = car_df.filter(['buying', 'maint', 'lug_boot', 'safety','class'])
categorical

     buying  maint lug_boot safety  class
0     vhigh  vhigh    small    low  unacc
1     vhigh  vhigh    small    med  unacc
2     vhigh  vhigh    small   high  unacc
3     vhigh  vhigh      med    low  unacc
4     vhigh  vhigh      med    med  unacc
...     ...    ...      ...    ...    ...
1723    low    low      med    med   good
1724    low    low      med   high  vgood
1725    low    low      big    low  unacc
1726    low    low      big    med   good
1727    low    low      big   high  vgood

[1728 rows x 5 columns]

In [23]:
myMapCat = {'vhigh': 4, 'high': 3, 'med': 2, 'low': 1, 'small': 1, 'big': 3, 'unacc': 1, 'acc': 2, 'good': 3, 'vgood': 4}
newCat = categorical.replace(myMapCat)
newCat

      buying  maint  lug_boot  safety  class
0          4      4         1       1      1
1          4      4         1       2      1
2          4      4         1       3      1
3          4      4         2       1      1
4          4      4         2       2      1
...      ...    ...       ...     ...    ...
1723       1      1         2       2      3
1724       1      1         2       3      4
1725       1      1         3       1      1
1726       1      1         3       2      3
1727       1      1         3       3      4

[1728 rows x 5 columns]

In [31]:
myTable = pd.concat([newNum, newCat], axis=1)
myTable

     doors persons  buying  maint  lug_boot  safety  class
0        2       2       4      4         1       1      1
1        2       2       4      4         1       2      1
2        2       2       4      4         1       3      1
3        2       2       4      4         2       1      1
4        2       2       4      4         2       2      1
...    ...     ...     ...    ...       ...     ...    ...
1723     5       5       1      1         2       2      3
1724     5       5       1      1         2       3      4
1725     5       5       1      1         3       1      1
1726     5       5       1      1         3       2      3
1727     5       5       1      1         3       3      4

[1728 rows x 7 columns]

In [32]:
X = myTable.drop(['class'], axis=1)
X
# train_test_split(X)

     doors persons  buying  maint  lug_boot  safety
0        2       2       4      4         1       1
1        2       2       4      4         1       2
2        2       2       4      4         1       3
3        2       2       4      4         2       1
4        2       2       4      4         2       2
...    ...     ...     ...    ...       ...     ...
1723     5       5       1      1         2       2
1724     5       5       1      1         2       3
1725     5       5       1      1         3       1
1726     5       5       1      1         3       2
1727     5       5       1      1         3       3

[1728 rows x 6 columns]

In [33]:
y = myTable.filter(['class'])
y

      class
0         1
1         1
2         1
3         1
4         1
...     ...
1723      3
1724      4
1725      1
1726      3
1727      4

[1728 rows x 1 columns]

In [34]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.40,random_state=0)

In [35]:
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [39]:
rf_clf = RandomForestClassifier(random_state=42, n_estimators=500)
classifier = rf_clf.fit(X_train, y_train)

/tmp/ipykernel_116641/2090139505.py:2: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  classifier = rf_clf.fit(X_train, y_train)

In [ ]:
y_pred = classifer.predict(X_test)
y_pred